# Задача №2. Секция статьи "Задача №2."
# Написать метод int32_to_ip, который принимает на вход 32-битное целое число
# (integer) и возвращает строковое представление его в виде IPv4-адреса:
#
# 2149583361 -> "128.32.10.1"
# 32         -> "0.0.0.32"
# 0          -> "0.0.0.0"


def int32_to_ip(ip_num):
    o1 = int(ip_num / 16777216) % 256
    o2 = int(ip_num / 65536) % 256
    o3 = int(ip_num / 256) % 256
    o4 = int(ip_num) % 256
    return '%(o1)s.%(o2)s.%(o3)s.%(o4)s' % locals()

# Example
print('2149583361 -> %s' % int32_to_ip(2149583361))
print('32 -> %s' % int32_to_ip(32))
print('0 -> %s' % int32_to_ip(0))
